app/Models/Appointment_Model.php

    public function createAppointmentByPatient($data)
    {
        if (!empty($data)) {
            $appointmentsTable = ['patient_id' => (int)$data['patient_id'], 'test_id' => (int)$data['test_id'], 'appointment_date' => $this->common_model->currentColomboTime(), 'note' => $data['note'], 'amount' => $data['amount'], 'paid' => $data['paid'], 'status' => APPOINTMENT_STATUS[0], 'due' => $data['due'], 'paid_via' => $data['paid_via'], 'active' => true];

            $this->db->table('appointments')->insert($appointmentsTable);
---
INSERT INTO `appointments` (`patient_id`, `test_id`, `appointment_date`, `note`, `amount`, `paid`, `status`, `due`, `paid_via`, `active`) VALUES (4, 4, '2024-03-20 22:54:28', '', '750.00', '0.01', 'Pending', '749.99', 'Cash', 1)

    public function addAppointmentHistory($appointmentId, $status)
    {
        $user_role_Table = ['appointment_id' => $appointmentId, 'status' => $status, 'update_by' => session('user_id'), 'created_at' => $this->common_model->currentColomboTime()];
        $this->db->table('appointment_history')->insert($user_role_Table);
---
INSERT INTO `appointment_history` (`appointment_id`, `status`, `update_by`, `created_at`) VALUES (19, 'Created', '12', '2024-03-20 22:54:28')

    public function getChartData()
    {
        // Define all statuses
        $statuses = ['Pending', 'In progress', 'Completed', 'Follow-up required', 'On hold', 'Rescheduled', 'Cancelled'];

        // Get current month and year
        $currentMonth = date('m');
        $currentYear = date('Y');

        // Calculate start and end dates of the current month
        $startDate = date('Y-m-01');
        $endDate = date('Y-m-d');

        // Initialize arrays to hold data
        $statusData = [];
        $dates = [];

        // Loop through each status
        foreach ($statuses as $status) {
            // Fetch appointments for each status and date within the current month
            $builder = $this->db->table('appointments');
            $appointments = $builder->select('DATE(appointment_date) as date, COUNT(*) as count')
                ->where('status', $status)
                ->where('YEAR(appointment_date)', $currentYear)
                ->where('MONTH(appointment_date)', $currentMonth)
                ->groupBy('date')
                ->get()
                ->getResultArray();
---
SELECT DATE(appointment_date) as date, COUNT(*) as count
FROM `appointments`
WHERE `status` = 'Pending'
AND YEAR(appointment_date) = '2024'
AND MONTH(appointment_date) = '03'
GROUP BY `date`