app/Models/GetData_Model.php

    public function getCountry()
    {
        return $this->db->table('country')
            ->get()
            ->getResult();
---
SELECT *
FROM `country`

    public function getProvince()
    {
        return $this->db->table('provinces')
            ->select('id, name_en as name')
            ->where('active', true)
            ->get()
            ->getResult();
---
SELECT `id`, `name_en` as `name`
FROM `provinces`
WHERE `active` = 1

    public function getDistrict()
    {
        return $this->db->table('districts')
            ->select('id, province_id, name_en AS name')
            ->get()
            ->getResult();
---
SELECT `id`, `province_id`, `name_en` AS `name`
FROM `districts`

    public function getCity()
    {
        return $this->db->table('cities')
            ->select('id, district_id, name_en as name')
            ->where('active', true)
            ->get()
            ->getResult();
---
SELECT `id`, `district_id`, `name_en` as `name`
FROM `cities`
WHERE `active` = 1

    public function getDashboardData()
    {
        // Get current month and year
        $currentMonth = date('m');
        $currentYear = date('Y');

        // Total Appointments for this month
        $appointmentsBuilder = $this->db->table('appointments');
        $totalAppointments = $appointmentsBuilder->where('YEAR(appointment_date)', $currentYear)
            ->where('MONTH(appointment_date)', $currentMonth)
            ->countAll();

        // Total Patients
        $patientsBuilder = $this->db->table('patients');
        $totalPatients = $patientsBuilder->countAll();

        // Total Income for this month
        $appointmentsBuilder = $this->db->table('appointments');
        $totalIncome = $appointmentsBuilder->selectSum('amount')
            ->where('YEAR(appointment_date)', $currentYear)
            ->where('MONTH(appointment_date)', $currentMonth)
            ->get()
            ->getRow()
            ->amount;

        // Paid Income for this month
        $appointmentsBuilder = $this->db->table('appointments');
        $paidIncome = $appointmentsBuilder->selectSum('paid')
            ->where('YEAR(appointment_date)', $currentYear)
            ->where('MONTH(appointment_date)', $currentMonth)
            ->get()
            ->getRow()
            ->paid;

        // Balance Income for this month
        $appointmentsBuilder = $this->db->table('appointments');
        $balanceIncome = $appointmentsBuilder->selectSum('due')
            ->where('YEAR(appointment_date)', $currentYear)
            ->where('MONTH(appointment_date)', $currentMonth)
            ->get()
            ->getRow()
            ->due;
---
SELECT COUNT(*) AS `numrows` FROM `patients`
SELECT SUM(`amount`) AS `amount`
FROM `appointments`
WHERE YEAR(appointment_date) = '2024'
AND MONTH(appointment_date) = '03'
SELECT SUM(`paid`) AS `paid`
FROM `appointments`
WHERE YEAR(appointment_date) = '2024'
AND MONTH(appointment_date) = '03'
SELECT SUM(`due`) AS `due`
FROM `appointments`
WHERE YEAR(appointment_date) = '2024'
AND MONTH(appointment_date) = '03'