app/Models/LabTest_Model.php

SELECT COUNT(*) AS `numrows`
FROM `test_list`
---
    public function getAllLabTest($postData = null)
    {
        $builder = $this->db->table('test_list');

        $columns = [
            0 => 'test_list.id',
            1 => 'test_list.name',
            2 => 'test_list.description',
            3 => 'test_list.cost',
            4 => 'test_list.active'
        ];

        $draw = $postData['draw'];
        $start = $postData['start'];
        $rowperpage = $postData['length'];
        $columnIndex = $postData['order'][0]['column'];
        $columnName = $columns[$columnIndex];
        $columnSortOrder = $postData['order'][0]['dir'];
        $searchValue = $postData['search']['value'];

        if (!empty($searchValue)) {
            $builder->like('test_list.id', $searchValue)
                ->orLike('test_list.name', $searchValue)
                ->orLike('test_list.description', $searchValue)
                ->orLike('test_list.cost', $searchValue);
        }

        $totalRecords = $builder->countAllResults(false);

SELECT `test_list`.*
FROM `test_list`
WHERE `test_list`.`active` = 1
---
    public function getLabTestsSelection()
    {
        $builder = $this->db->table('test_list');
        $builder->select('test_list.*')
                ->where('test_list.active', true);
        return $builder->get()->getResultArray();