app/Models/Patient_Model.php

    public function getDataAll(){
        $builder = $this->db->table('patients');
        $builder->select('patients.*, users.email, users.nic, CONCAT(users.first_name, " ", users.last_name) AS name, users.gender, users.phone, users.dob, users.join_date, users.active as user_active');
        $builder->join('users', 'patients.user_id = users.id', 'left');
        $query = $builder->get();
---
SELECT `patients`.*, `users`.`email`, `users`.`nic`, CONCAT(users.first_name, " ", users.last_name) AS name, `users`.`gender`, `users`.`phone`, `users`.`dob`, `users`.`join_date`, `users`.`active` as `user_active`
FROM `patients`
LEFT JOIN `users` ON `patients`.`user_id` = `users`.`id`

    public function getDataAllTest(){
        $builder = $this->db->table('patients');
        $builder->select('patients.*, users.email, users.nic, CONCAT(users.first_name, " ", users.last_name) AS name, users.gender, users.phone, users.dob, users.join_date, users.active as user_active');
        $builder->join('users', 'patients.user_id = users.id', 'left');
        $query = $builder->get();
---
SELECT `patients`.*, `users`.`email`, `users`.`nic`, CONCAT(users.first_name, " ", users.last_name) AS name, `users`.`gender`, `users`.`phone`, `users`.`dob`, `users`.`join_date`, `users`.`active` as `user_active`
FROM `patients`
LEFT JOIN `users` ON `patients`.`user_id` = `users`.`id`

    public function getPatientByUserId($user_id)
    {
        $builder = $this->db->table('patients');
        $builder->select('patients.id');
        $builder->where('patients.user_id', $user_id);
        $query = $builder->get();
---
SELECT `patients`.`id`
FROM `patients`
WHERE `patients`.`user_id` = '12'