app/Models/Permissions_Model.php

    public function getDataAll()
    {
        $query = $this->db->table('permissions')->get();
---
SELECT *
FROM `permissions`