app/Models/Roles_Model.php

SELECT COUNT(*) AS `numrows`
FROM `roles`
---
    public function getAllRoles($postData = null)
    {
        $builder = $this->db->table('roles');

        $columns = [
            0 => 'roles.id',
            1 => 'roles.name',
            2 => 'roles.description',
            3 => 'roles.active'
        ];

        $draw = $postData['draw'];
        $start = $postData['start'];
        $rowperpage = $postData['length'];
        $columnIndex = $postData['order'][0]['column'];
        $columnName = $columns[$columnIndex];
        $columnSortOrder = $postData['order'][0]['dir'];
        $searchValue = $postData['search']['value'];

        if (!empty($searchValue)) {
            $builder->like('roles.id', $searchValue)
                ->orLike('roles.name', $searchValue)
                ->orLike('roles.description', $searchValue);
        }

        $totalRecords = $builder->countAllResults(false);

SELECT *
FROM `roles`
---
    public function getDataAll()
    {
        $query = $this->db->table('roles')->get();