app/Models/RolePermission_Model.php

    public function getAllRolesByCurrentUserId()
    {
        $roleId = (session('role_id'))?session('role_id'):1;
        return $this->db->table('roles')
            ->select('id, name')
            ->where('id >=', $roleId)
            ->get()
            ->getResultArray();
---
SELECT `id`, `name`
FROM `roles`
WHERE `id` >= '2'

    public function userHasPermission($permissionName)
    {
        $userId = session('user_id');
        $roleName = session('role');

        try {
            $role = $this->db->table('roles')
                ->where('name', $roleName)
                ->get()
                ->getRow();
            if (!$role) {
                throw new \Exception("Role '{$roleName}' not found.");
            }

            $userRoles = $this->db->table('user_roles')
                ->select('role_id')
                ->where('user_id', $userId)
                ->get()
                ->getResultArray();
            $userRoleIds = array_column($userRoles, 'role_id');

            $permission = $this->db->table('permissions')
                ->where('name', $permissionName)
                ->get()
                ->getRow();
            if (!$permission) {
                throw new \Exception("Permission not found.");
            }

            $rolesWithPermission = $this->db->table('role_permissions')
                ->whereIn('role_id', $userRoleIds)
                ->where('permission_id', $permission->id)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `roles`
WHERE `name` = 'admin'
SELECT `role_id`
FROM `user_roles`
WHERE `user_id` = '1'
SELECT *
FROM `permissions`
WHERE `name` = 'allPatient'
SELECT *
FROM `role_permissions`
WHERE `role_id` IN ('2')
AND `permission_id` = '22'