app/Models/UserModel.php

SELECT `users`.*, `roles`.`id` as `role_id`, `roles`.`name` as `role_name`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `users`.`username` = 'admin'
AND `users`.`active` = 1
---
    public function checkLogin($data){
        $passwordLib = new Password(); // Load the Password library manually
        $userInfo = $this->db->table('users')
            ->select('users.*, roles.id as role_id, roles.name as role_name')
            ->join('user_roles', 'user_roles.user_id = users.id')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->where('users.username', $data['username'])
            ->where('users.active', true)
            ->get()
            ->getRow();

SELECT `users`.*, `roles`.`id` as `role_id`, `roles`.`name` as `role_name`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `users`.`email` = 'asakal@mail.com'
AND `users`.`active` = 1
---
    public function checkLoginByEmail($data){
        $passwordLib = new Password(); // Load the Password library manually
        $userInfo = $this->db->table('users')
            ->select('users.*, roles.id as role_id, roles.name as role_name')
            ->join('user_roles', 'user_roles.user_id = users.id')
            ->join('roles', 'roles.id = user_roles.role_id')
            ->where('users.email', $data['email'])
            ->where('users.active', true)
            ->get()
            ->getRow();

UPDATE `users` SET `last_login` = '2024-03-14 13:30:29'
WHERE `id` = '1'
---
    public function updateLoginTime($userId){
        $timeNow = $this->commonModel->currentColomboTime();
        $this->db->table('users')->where('id', $userId)->update(['last_login' => $timeNow]);

SELECT *
FROM `users`
WHERE `username` = 'admin'
---
    public function userExist($username){
        return $this->db->table('users')->where('username', $username)->get()->getRow();

SELECT *
FROM `users`
WHERE `email` = 'asakal@mail.com'
---
    public function userExistByEmail($email){
        return $this->db->table('users')->where('email', $email)->get()->getRow();

UPDATE `login_attempts` SET `attempt_count` = 0, `last_attempt` = '2024-03-14 13:30:29'
WHERE `user_id` = '1'
---
    public function resetLoginAttempts($userId) {
        $timeNow = $this->commonModel->currentColomboTime();
        $data = [
            'attempt_count' => 0,
            'last_attempt' => $timeNow
        ];
        $this->db->table('login_attempts')->where('user_id', $userId)->update($data);

SELECT `users`.*, `roles`.`id` as `role_id`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
WHERE `users`.`id` IS NULL
---
    public function getUserDataById($user_id)
    {
        $builder = $this->db->table('users');
        $builder->select('users.*, roles.id as role_id');
        $builder->join('user_roles', 'user_roles.user_id = users.id');
        $builder->join('roles', 'roles.id = user_roles.role_id');
        $builder->where('users.id', $user_id);
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
---
    public function getAllAuthUsers($postData = null)
    {
        $columns = [
            // datatable column index  => database column name
            0 => 'users.id',
            1 => 'CONCAT(users.first_name, " ", users.last_name) as full_name',
            2 => 'users.phone',
            3 => 'users.active',
            4 => 'roles.name as role_name'
        ];

        $draw = $postData['draw'] ?? null;
        $start = $postData['start'] ?? null;
        $rowperpage = $postData['length'] ?? null; // Rows display per page
        $columnIndex = $postData['order'][0]['column'] ?? null; // Column index
        $columnName = $columns[$columnIndex] ?? null; // Column name
        $columnSortOrder = $postData['order'][0]['dir'] ?? null; // asc or desc
        $searchValue = $postData['search']['value'] ?? null; // Search value

        ## Search
        $searchQuery = "";
        if ($searchValue != '') {
            $searchQuery = "users.id IS NOT NULL AND (users.id LIKE '%".$searchValue."%' OR users.first_name LIKE '%".$searchValue."%' OR users.last_name LIKE '%".$searchValue."%' OR users.phone LIKE '%".$searchValue."%' OR roles.name LIKE '%".$searchValue."%')";
        }

        ## Total number of records without filtering
        $totalRecords = $this->db->table('users')
            ->select('count(*) as allcount')
            ->join('user_roles', 'user_roles.user_id = users.id')
            ->join('roles', 'roles.id = user_roles.role_id')

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
---
            ->countAllResults(false);

        ## Total number of records with filtering
        $totalRecordwithFilter = $this->db->table('users')
            ->select('count(*) as allcount')
            ->join('user_roles', 'user_roles.user_id = users.id')
            ->join('roles', 'roles.id = user_roles.role_id');

SELECT `users`.`id`, `users`.`nic`, `users`.`username`, `users`.`first_name`, `users`.`last_name`, `users`.`gender`, `users`.`phone`, `users`.`last_login`, `users`.`active`, `roles`.`name` as `role_name`
FROM `users`
JOIN `user_roles` ON `user_roles`.`user_id` = `users`.`id`
JOIN `roles` ON `roles`.`id` = `user_roles`.`role_id`
ORDER BY `users`.`id` ASC
 LIMIT 30
---
        $totalRecordwithFilter = $totalRecordwithFilter->countAllResults(false);

        ## Fetch records
        $records = $this->db->table('users')
            ->select('users.id, users.nic, users.username, users.first_name, users.last_name, users.gender, users.phone, users.last_login, users.active, roles.name as role_name')
            ->join('user_roles', 'user_roles.user_id = users.id')
            ->join('roles', 'roles.id = user_roles.role_id');

SELECT `users`.`id`, `users`.`email`, CONCAT(users.first_name, " ", users.last_name) AS name, `users`.`gender`, `users`.`phone`, `users`.`dob`, `users`.`join_date`, `users`.`address`, `users`.`district`, `users`.`active`
FROM `users`
JOIN `user_roles` ON `users`.`id` = `user_roles`.`user_id`
WHERE `users`.`active` = 1
AND `user_roles`.`role_id` = 7
---
    public function getUsersByRole($roleId)
    {
        $builder = $this->db->table('users');
        $builder->select('users.id, users.email, CONCAT(users.first_name, " ", users.last_name) AS name, users.gender, users.phone, users.dob, users.join_date, users.address, users.district, users.active');
        $builder->join('user_roles', 'users.id = user_roles.user_id');
        $builder->where('users.active', true);
        $builder->where('user_roles.role_id', $roleId);

        return $builder->get()->getResultArray();